Tekla Open API Reference for Tekla Structures 2025
Mesh.AddTriangle Method
 Adds a new triangle in the mesh.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddTriangle(
	int Index1,
	int Index2,
	int Index3
)
Public Sub AddTriangle (
	Index1 As Integer,
	Index2 As Integer,
	Index3 As Integer
)
Parameters
Index1
Type: System.Int32
The index of the triangle's first point in the points array list.
Index2
Type: System.Int32
The index of the triangle's second point in the points array list.
Index3
Type: System.Int32
The index of the triangle's third point in the points array list.
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace